Repository: geraldloss/glmorphquiz
Catalog: Resources/Private/Language/*.locallang_flexForms.xlf
Languages: de

# flexform.plugin.general.sheet_title
source: Basic configurations
de: Standardeinstellungen

# flexform.plugin.general.firstWord
source: The first word of the morphing game
de: Das erste Wort des Verwandlungsrätsels

# flexform.plugin.general.fontsize
source: Fontsize
de: Schriftgröße

# flexform.plugin.general.width
source: Width for the box of every letter.
de: Breite des Kastens um jeden Buchstaben

# flexform.plugin.general.height
source: Height of the box around every letter
de: Höhe des Kastens um jeden Buchstaben

# flexform.plugin.general.cssFile
source: Alternate css file
de: Alternative CSS-Datei

# flexform.plugin.advanced.sheet_title
source: Advanced Settings
de: Erweitert Einstellungen

# flexform.plugin.heigth_letter
source: Height of the letter inputboxes
de: Höhe der Buchstabeneingabeboxen

# flexform.plugin.width_letter
source: Width of a single letter for the inputboxes
de: Breite eines einzelnen Buchstabens der Buchstabeneingabeboxen

# flexform.plugin.general.width_letter_offset
source: Offset of the width of the letter inputboxes
de: Offset der Buchstabeneingabeboxen

# flexform.plugin.general.firstcol_width
source: Width of the first collumn with the arrow
de: Breite der ersten Spalte mit dem Pfeil

# flexform.plugin.general.arrow_width
source: Width of the image with the arrow
de: Breite des Bildes mit dem Pfeil

# flexform.plugin.general.arrowFile
source: Alternate arrow image file
de: Alternative Bilddatei mit dem Pfeil

# flexform.plugin.general.animation_speed
source: Speed of the arrow animation in milliseconds
de: Geschwindigkeit der Animation mit dem Pfeil in Millisekunden

# flexform.plugin.general.points
source: Points for the right answer
de: Punkte für eine richtige Antwort

# flexform.plugin.general.minus_points
source: Minus points for the wrong answer
de: Minuspunkte für die falsche Antwort

# flexform.plugin.general.has_finishtext
source: The final texts at the end of the game
de: The Schlusstexte am Ende des Spiels

# flexform.plugin.general.show_last
source: Show the last word
de: Zeige das letzte Wort
