Repository: geraldloss/glmorphquiz
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: de

# tx_glmorphquiz_domain_model_word
source: Word
de: Wort

# tx_glmorphquiz_domain_model_word.value
source: Value
de: Inhalt

# tx_glmorphquiz_domain_model_word.next_word
source: Next Word
de: Nächstes Wort

# tx_glmorphquiz_domain_model_word.mask
source: Mask
de: Maske

# tx_glmorphquiz_domain_model_word.start
source: First word
de: Erstes Wort

# tx_glmorphquiz_domain_model_word.fontsize
source: Fontsize
de: Fontgröße

# tx_glmorphquiz_domain_model_word.heigth_letter
source: Height of a letter inputbox
de: Höhe der Buchstabeneingabebox

# tx_glmorphquiz_domain_model_word.width_letter
source: Width of a single letter for the inputbox
de: Breite eines einzelnen Buchstabens der Buchstabeneingabebox

# tx_glmorphquiz_domain_model_word.width_letter_offset
source: Offset of the width of the letter inputbox
de: Offset der Buchstabeneingabebox

# tx_glmorphquiz_domain_model_word.firstcol_width
source: Width of the first collumn with the arrow
de: Breite der ersten Spalte mit dem Pfeil

# tx_glmorphquiz_domain_model_word.arrow_width
source: Width of the image with the arrow
de: Breite des Bildes mit dem Pfeil

# tx_glmorphquiz_domain_model_word.animation_speed
source: Speed of the arrow animation in milliseconds
de: Geschwindigkeit der Animation mit dem Pfeil in Millisekunden

# tx_glmorphquiz_domain_model_word.points
source: Points for the right answer
de: Punkte für eine richtige Antwort

# tx_glmorphquiz_domain_model_word.minus_points
source: Minus points for a wrong answer
de: Minuspunkte für eine falsche Antwort

# tx_glmorphquiz_domain_model_word.tabpoints
source: Settings for points
de: Punkteeinstellungen

# tx_glmorphquiz_domain_model_word.tabadvanced
source: Advanced settings
de: Erweitert

# tx_glmorphquiz_domain_model_finishingtext
source: Finishingtext
de: Abschlusstext

# tx_glmorphquiz_domain_model_finishingtext.minpoints
source: Minimum points
de: Mindestpunktzahl

# tx_glmorphquiz_domain_model_finishingtext.text
source: Finishing Text
de: Abschlusstext
