Repository: geraldloss/glmorphquiz
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# frontend_error_title
source: Error:
de: Fehler:

# frontend_zero_length_word
source: The word with the name "%s" and the uid "%s" has no word defined.
de: Für das Wort mit dem Namen "%s" und der uid "%s" wurde kein Wort hinterlegt.

# frontend_other_length_word
source: The word with the name "%s" and the UID "%s" has another length (%s) then the word before with the name "%s" and the UID "%s" with length %s. It must have all words the same length.
de: Für das Wort mit dem Namen "%s" und der uid "%s" wurde ein Wort mit einer anderen Länge (%s) hinterlegt, als für das Wort davor mit dem Namen "%s" der UID "%s" und der Länge %s. Es müssen aber immer alle Wörter gleich lang sein.

# frontend_infinite_loop
source: Exception because of invinite loop. There are double references to the word with the UID: "%s" and the name: "%s" from word with name: "%s" and UID: "%s" and another word(s).
de: Ausnahme wegen Endlosschleife: Es existieren doppeltes Referenzen auf das Wort mit der UID: "%s" und den Namen: "%s" vom Wort mit dem Namen: "%s" und der UID: "%s" und einem anderen Wort/Worten.

# frontend_letter_changings
source: Between the word with the name "%s" and the UID "%s" and the word with the name "%s" and the UID "%s" is not exactly one letter difference. There are %s letters different between "%s" and "%s". Please correct this issue.
de: Zwischen dem Wort mit dem Namen "%s" und der UID "%s" und dem Wort mit dem Namen "%s" und der UID "%s" besteht kein Unterschied von exakt einem Buchstaben. Es sind %s Buchstaben unterschiedlich zwischen "%s" und "%s". Bitte korrigieren Sie dieses Problem.

# fluid_button_next
source: Next
de: Weiter

# fluid_button_solve
source: Solve
de: Lösen

# frontend_wrong_answer
source: This was not correct. Please try again!
de: Das war nicht richtig. Versuchen Sie es noch mal!

# frontend_tomany_wrong_answers
source: Please remember. You are only allowed to change one single letter from word to word. But you have changed %s letters.
de: Bitte denken Sie daran. Es darf sich von Wort zu Wort immer nur ein Buchstabe ändern. Sie haben aber %s Buchstaben geändert

# fluid_points
source: Points:
de: Punkte:

# frontend_correct_answer
source: This answer was correct.
de: Die Antwort war richtig.

# frontend_solved_answer
source: That would have been the correct answer for this word.
de: Das wäre die richtige Anwort für dieses Wort gewesen.

# frontend_default_finishingtext
source: You have finished the game.
de: Sie haben das Spiel beendet.
