Repository: geraldloss/glmorphquiz
Catalog: Resources/Private/Language/*.locallang_csh_tx_glmorphquiz_domain_model_word.xlf
Languages: de

# name.description
source: The name of the word for internal use
de: Der Name des Wortes zur internen Verwendung

# start.description
source: The first word in the morphing quiz.
de: Das erste Wort in dem Verwandlungsrätsel

# value.description
source: the word itself
de: Das Wort selber

# next_word.description
source: The next word after this word. If empty this is the last word of the quiz.
de: Das Wort, welches direkt nach diesem kommt. Wenn Leer, dann handelt es sich um das letzte Wort in diesem Quiz.

# mask.alttitle
source: Edit mask for the word
de: Schreibmaske für das Wort

# mask.description
source: Configure if some letters should come together in one field. Click here for more details.
de: Steuert wie viele Buchstaben in ein Feld bei der Antwort kommen. Klicken Sie hier für eine genau Beschreibung.

# mask.details
source: You can for every field describe how many letter it should contain. For instance if the first 3 fields should contain only one letter and the fourth field should contain 2 letters, then you have to write 1112 into this field. If all fields after the fourth field contain only one letter again, then you can omit this in the mask. If all fields contain only one field, then left the mask empty
de: Hier kann definiert werden wieviele Buchstaben in ein Feld bei einer Antwort kommen sollen. Wenn zum Beispiel die ersten drei Buchstaben in jeweils ein Feld der Lösungsmaske kommen und in das vierte Feld zwei Buchstaben kommen sollen, dann muss in die Schreibmaske 1112 geschrieben werden. Wenn nach dem vierten Feld in alle Felder nur ein Buchstabe kommen soll, dann können diese in der Schreibmaske weggelassen werden. Soll für die gesamte Antwort jeweils in ein Feld ein Buchstabe kommen, dann kann die Schreibmaske ganz leer gelassen werden.

# mask.syntax
source: If the word ist weather and you want th in one field then write 1112111 or 1112
de: Wenn das Wort "wischen" heißt und "sch" in ein Feld soll, dann muss die schreibmaske 11311 oder 113 lauten.

# width_letter.description
source: Is in this letter box more than one letter, then the width is a multiply of the count of the letters.
de: Wenn in die Buchstabeneingabebox mehr als ein Buchstabe kommen, dann ist die Breite der Eingabebox das Produkt der Anzahl an Buchstaben mit dem Wert in diesem Feld.

# fontsize.description
source: Size of the font in the inputbox. Here can you overrule the setting of this value in the flexgrid of the frontend plugin. If you enter 0, than the value of the overall flexgrid option of the frontend plugin will be taken.
de: Größe des Fonts in der Buchstabeneingabebox. Hier können Sie die Einstellung für diesen Eintrag in den Einstellungen des Flexgrid für das Frontend Plugin übersteuern. Wenn Sie hier 0 eingeben, dann gelten die Einstellungen in den übergreifenden Einstellungen vom Frontend Plugin.

# heigth_letter.description
source: Height of a letter inputbox. Here can you overrule the setting of this value in the flexgrid of the frontend plugin. If you enter 0, than the value of the overall flexgrid option of the frontend plugin will be taken.
de: Höhe der Buchstabeneingabebox. Hier können Sie die Einstellung für diesen Eintrag in den Einstellungen des Flexgrid für das Frontend Plugin übersteuern. Wenn Sie hier 0 eingeben, dann gelten die Einstellungen in den übergreifenden Einstellungen vom Frontend Plugin.

# width_letter.description
source: Is in this letter box more than one letter, then the width is a multiply of the count of the letters. Here can you overrule the setting of this value in the flexgrid of the frontend plugin. If you enter 0, than the value of the overall flexgrid option of the frontend plugin will be taken. Click here for details.
de: Wenn in der Buchstabeneingabebox mehr als ein Buchstabe zugelassen ist, dann beträgt die Gesamtbreite der Box den Wert in diesem Feld Multipliziert mit der Anzahl an zugelassenen Buchstaben. Hier können Sie die Einstellung für diesen Eintrag in den Einstellungen des Flexgrid für das Frontend Plugin übersteuern. Wenn Sie hier 0 eingeben, dann gelten die Einstellungen in den übergreifenden Einstellungen vom Frontend Plugin. Klicken Sie hier für Details.

# width_letter_offset.description
source: This offset is added to the width of a letter box. Click here for details.
de: Dieser Offset wird zusätzlich zu der Breite einer Buchstabeneingabebox hinzu addiert. Klicken Sie hier für Details.

# width_letter_offset.details
source: The width of a letter box is the sum of the offset with the multiply of the count of letters in this box with the width of a single letter. Example: If the offset is 3 and the widht is 12 than is the total width of a inputbox with two letter 27 = 3 + (2*12). Here can you overrule the setting of this value in the flexgrid of the frontend plugin. If you enter 0, than the value of the overall flexgrid option of the frontend plugin will be taken.
de: Die Breite einer Buchstabeneingabebox ist die Summe aus dem Offset und dem Produkt mit der Anzahl an Buchstaben in dieser Eingabebox und der Breite für einen Buchstaben. Beispiel: Wenn der Offset 3 beträgt und die Breite eines Buchstabens 12 dann beträgt die gesamtgröße einer Buchstabeneingabebox mit zwei Buchstaben 27 = 3 + (2*12). Hier können Sie die Einstellung für diesen Eintrag in den Einstellungen des Flexgrid für das Frontend Plugin übersteuern. Wenn Sie hier 0 eingeben, dann gelten die Einstellungen in den übergreifenden Einstellungen vom Frontend Plugin.

# firstcol_width.description
source: Width of the first collumn with the arrow.
de: Breite der ersten Spalte mit dem animierten Pfeil

# arrow_width.description
source: With of the arrow. Change this value only if you have changed the image of the arrow.
de: Breite des Pfeils. Ändern Sie diesen Wert nur, wenn Sie das Bild mit dem Pfeil geändert haben.

# animation_speed.description
source: Change the duration of the movement of the arrow in the beginning in Milliseconds. Here can you overrule the setting of this value in the flexgrid of the frontend plugin. If you enter 0, than the value of the overall flexgrid option of the frontend plugin will be taken.
de: Dauer der Animation des Pfeils am Anfang in Milliskunden. Hier können Sie die Einstellung für diesen Eintrag in den Einstellungen des Flexgrid für das Frontend Plugin übersteuern. Wenn Sie hier 0 eingeben, dann gelten die Einstellungen in den übergreifenden Einstellungen vom Frontend Plugin.

# points.description
source: Points for a correct answer. Set 0 if you don't want points. Here can you overrule the setting of this value in the flexgrid of the frontend plugin. If you enter 0, than the value of the overall flexgrid option of the frontend plugin will be taken.
de: Punkte für eine richtige Antwort. Wenn Sie keine Punkte wollen, setzen Sie diesen Wert auf 0. Hier können Sie die Einstellung für diesen Eintrag in den Einstellungen des Flexgrid für das Frontend Plugin übersteuern. Wenn Sie hier 0 eingeben, dann gelten die Einstellungen in den übergreifenden Einstellungen vom Frontend Plugin.

# minus_points.description
source: Points for a wrong answer. Set 0 if you don't want minus points. Here can you overrule the setting of this value in the flexgrid of the frontend plugin. If you enter 0, than the value of the overall flexgrid option of the frontend plugin will be taken.
de: Punkte für eine falsche Antwort. Wenn Sie keine Minuspunkte wollen, setzen Sie diesen Wert auf 0. Hier können Sie die Einstellung für diesen Eintrag in den Einstellungen des Flexgrid für das Frontend Plugin übersteuern. Wenn Sie hier 0 eingeben, dann gelten die Einstellungen in den übergreifenden Einstellungen vom Frontend Plugin.
